{
  "_class_name": "Zero123PlusPipeline",
  "_diffusers_version": "0.20.2",
  "_name_or_path": "sudo-ai/zero123plus-v1.1",
  "feature_extractor_clip": [
    "transformers",
    "CLIPImageProcessor"
  ],
  "feature_extractor_vae": [
    "transformers",
    "CLIPImageProcessor"
  ],
  "ramping_coefficients": [
    0.0,
    0.2060057818889618,
    0.18684479594230652,
    0.24342191219329834,
    0.18507817387580872,
    0.1703828126192093,
    0.15628913044929504,
    0.14174538850784302,
    0.13617539405822754,
    0.13569170236587524,
    0.1269884556531906,
    0.1200924888253212,
    0.12816639244556427,
    0.13058121502399445,
    0.14201879501342773,
    0.15004529058933258,
    0.1620427817106247,
    0.17207716405391693,
    0.18534132838249207,
    0.20002241432666779,
    0.21657466888427734,
    0.22996725142002106,
    0.24613411724567413,
    0.25141021609306335,
    0.26613450050354004,
    0.271847128868103,
    0.2850190997123718,
    0.285749226808548,
    0.2813953757286072,
    0.29509517550468445,
    0.30109965801239014,
    0.31370124220848083,
    0.3134534955024719,
    0.3108579218387604,
    0.32147032022476196,
    0.33548328280448914,
    0.3301997184753418,
    0.3254660964012146,
    0.3514464199542999,
    0.35993096232414246,
    0.3510829508304596,
    0.37661612033843994,
    0.3913513123989105,
    0.42122599482536316,
    0.3954688012599945,
    0.4260983467102051,
    0.479139506816864,
    0.4588979482650757,
    0.4873477816581726,
    0.5095643401145935,
    0.5133851170539856,
    0.520708441734314,
    0.5363377928733826,
    0.5661528706550598,
    0.5859065651893616,
    0.6207258701324463,
    0.6560986638069153,
    0.6379964351654053,
    0.6777164340019226,
    0.6589891910552979,
    0.7574057579040527,
    0.7446827292442322,
    0.7695522308349609,
    0.8163619041442871,
    0.9502472281455994,
    0.9918442368507385,
    0.9398387670516968,
    1.005432367324829,
    0.9295969605445862,
    0.9899859428405762,
    1.044832706451416,
    1.0427014827728271,
    1.0829696655273438,
    1.0062562227249146,
    1.0966323614120483,
    1.0550328493118286,
    1.2108079195022583
  ],
  "safety_checker": [
    null,
    null
  ],
  "scheduler": [
    "diffusers",
    "EulerAncestralDiscreteScheduler"
  ],
  "text_encoder": [
    "transformers",
    "CLIPTextModel"
  ],
  "tokenizer": [
    "transformers",
    "CLIPTokenizer"
  ],
  "unet": [
    "diffusers",
    "UNet2DConditionModel"
  ],
  "vae": [
    "diffusers",
    "AutoencoderKL"
  ],
  "vision_encoder": [
    "transformers",
    "CLIPVisionModelWithProjection"
  ]
}
